# ü•â DAY 3 ‚Äî Sorting & Value Counts

In [1]:
import pandas as pd

df = pd.read_csv("../New folder/Project_Assignment/Cust_Purch_FakeData.csv")
df1 = pd.read_csv('../numpy_practice/jupyter/pandas_practice/Movies_dataset.csv')
df2 = pd.read_csv('../numpy_practice/jupyter/pandas_practice/top_250_imdb_dataset.csv')
df3 = pd.read_csv('../numpy_practice/jupyter/pandas_practice/Students Social Media Addiction.csv')

# Customer

In [8]:
# 1Ô∏è‚É£ Top 10 highest purchase

(
    df['price(CAD)']
        .sort_values(ascending = False)
        .head(10)
        .reset_index(name = 'top_10_purchase')
)

   index  top_10_purchase
0     76           100.00
1  24385           100.00
2  21093           100.00
3   2903            99.99
4   6443            99.99
5  16278            99.99
6   8353            99.99
7  26524            99.99
8  15287            99.99
9  23465            99.98

In [7]:
# 2Ô∏è‚É£ Lowest 5 purchases

(
    df['price(CAD)']
        .sort_values(ascending = True)
        .head(5)
        .reset_index(name = 'Lowest_5_purchases')
)

   index  Lowest_5_purchases
0   5320                0.00
1  10597                0.00
2    653                0.01
3  17238                0.02
4   6735                0.02

In [11]:
# 3Ô∏è‚É£ Gender count

(
    df['gender']
        .value_counts()
        .reset_index(name = 'total')
)

   gender  total
0  Female  15147
1    Male  14853

In [18]:
# 4Ô∏è‚É£ Country count

( 
    df3['Country']
        .value_counts()
        .reset_index(name = 'total')
)

         Country  total
0          India     53
1            USA     40
2         Canada     34
3         France     27
4         Mexico     27
..           ...    ...
105         Oman      1
106  Afghanistan      1
107        Syria      1
108        Yemen      1
109       Bhutan      1

[110 rows x 2 columns]

# Movies

In [21]:
# 5Ô∏è‚É£ Top 10 longest movies

(
    df2['Duration_Minutes']
         .sort_values( ascending = False)
         .head(10)
         .reset_index(name = 'top_10_longest_movie')
)

   index  top_10_longest_movie
0    160                   374
1    247                   321
2    164                   238
3     88                   229
4     98                   227
5    182                   212
6     22                   207
7      3                   202
8      5                   201
9      6                   195

In [26]:
# 6Ô∏è‚É£ Top 5 most voted movies

(
    df1['vote_count']
        .sort_values(ascending = False)
        .head(5)
        .reset_index(name = 'top_5_voted_movies')
)

   index  top_5_voted_movies
0     14               38436
1     41               38375
2      6               34849
3    465               34558
4   1038               32998

In [31]:
# 7Ô∏è‚É£ Movies per year (value_counts)

(
   df2['Year']
       .value_counts()
       .reset_index(name = 'total_movies_per_year')
)

    Year  total_movies_per_year
0   1995                      8
1   2003                      7
2   2004                      7
3   1999                      6
4   2019                      6
..   ...                    ...
81  1925                      1
82  1924                      1
83  1926                      1
84  1949                      1
85  1928                      1

[86 rows x 2 columns]

# Students

In [33]:
# 8Ô∏è‚É£ Platform usage count

(
    df3['Most_Used_Platform']
        .value_counts()
        .reset_index(name = 'total')
)

   Most_Used_Platform  total
0           Instagram    249
1              TikTok    154
2            Facebook    123
3            WhatsApp     54
4             Twitter     30
5            LinkedIn     21
6              WeChat     15
7            Snapchat     13
8           VKontakte     12
9                LINE     12
10          KakaoTalk     12
11            YouTube     10

In [38]:
# 9Ô∏è‚É£ Top 10 addicted students

(
    df3[['Student_ID' ,'Addicted_Score']]
         .sort_values(by = 'Addicted_Score', ascending = False)
         .head(10)
)

     Student_ID  Addicted_Score
684         685               9
675         676               9
641         642               9
63           64               9
658         659               9
667         668               9
25           26               9
616         617               9
79           80               9
607         608               9

In [40]:
# üîü Top 10 daily usage students

(
    df3[['Student_ID' , 'Avg_Daily_Usage_Hours']]
         .sort_values(by = 'Avg_Daily_Usage_Hours', ascending = False )
         .head(10)
)

     Student_ID  Avg_Daily_Usage_Hours
496         497                    8.5
486         487                    8.4
476         477                    8.3
466         467                    8.2
456         457                    8.1
446         447                    8.0
436         437                    7.9
426         427                    7.8
416         417                    7.7
406         407                    7.6